app/controllers/social_users/omniauth_callbacks_controller.rb

  def facebook
      q = SocialUser.find_for_facebook_oauth request.env["omniauth.auth"], cookies
---
SELECT "users".* FROM "users" WHERE "users"."created_at" = '5' LIMIT 1