app/controllers/admin_controller.rb

  def allow
    if current_social_user.user.admin?
      m=Message.find(params[:id])
      "s"
      unless m.nil?
        m.checked=1
        m.save!
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "messages" SET "checked" = 1, "updated_at" = '2012-12-29 20:51:14.713075' WHERE "messages"."id" = 1