app/controllers/message_controller.rb

INSERT INTO "messages" ("checked", "created_at", "message", "social_user_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["checked", 0], ["created_at", Sat, 29 Dec 2012 20:14:54 UTC +00:00], ["message", "asfdgf."], ["social_user_id", 2], ["updated_at", Sat, 29 Dec 2012 20:14:54 UTC +00:00]]
---
  def create
    if !social_user_signed_in?
      redirect_to :controller => "main", :action => "home"
    end

    if request.post?

      message = Message.new
      message.social_user_id = current_social_user.id
      message.message = params[:message].values[0].to_message
      message.created_at = Time.now

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "messages" WHERE "messages"."id" = 2
---
  def delete
    message = Message.find(params[:id])
    if !message.nil?
      message.delete if message.social_user == current_social_user